[
  {
    "reference": ["[1989] 2 SLR(R) 217", "[1989] SGHC 75"],
    "date": "24 August 1989",
    "court": "High Court",
    "coram": ["Lai Kew Chai J", "F A Chua J"],
    "counsel": {
      "prosecution": ["Lee Sing Lit"],
      "defence": ["Lee Ah Fong"]
    },
    "parties": ["Public Prosecutor", "Goh Ah Lim"],
    "paragraphs": {
      "1": "The accused, a male Chinese aged 46, faced in the alternative two capital charges under the Misuse of Drugs Act (Cap 185) (“the Act”). The Prosecution preferred the two charges in the alternative under s 172 of the Criminal Procedure Code. The first charge stated that at about 5.00pm on 20 December 1986 at departure gate D63 of Changi International Airport he did attempt to export from Singapore 1,269.8g of diamorphine contrary to s 7 read with s 12 of the Act. The alternative charge stated that between 5.00am and 5.00pm on the same day, he did traffick in the same quantity of diamorphine contrary to s 5(a) of the Act.",
      "2": "The evidence led by the Prosecution was as follows. At about 5.00pm on 20 December 1986 PC Zainudin bin Jamal was performing anti-hijack body frisking duty at the said departure room on passengers who were shortly due to emplane on British Airways flight BA 11 for Australia. The plane was due to depart at 5.40pm. He saw the accused approach the boarding room. He saw him carrying a duty-free bag containing a bottle of Martell and a carton of Dunhill cigarettes. He stopped the accused for a routine search. He frisked the accused and found that the waist band of the accused’s trousers and both his thighs were bulging. He then questioned the accused about the contents in the bulges. The accused replied “nothing”. He noticed that his face suddenly turned pale and he looked nervous. He questioned him again and the accused again replied “nothing”. PC Zainudin then tapped at the bulging waist band and noticed some whitish powdery substance appearing on the surface. When he approached the accused, he had a strange smell. It was not body odour. Suspecting that the substance was something illegal, he detained the accused. He seized his passport, identity card, air ticket and his boarding pass. He informed his colleagues of the matter. The party went to the airport police station. He lodged a police report. He continued to assist in the investigation and with other officers accompanied the accused to CNB where they arrived at 8.15pm.",
      "3": "In cross-examination, it was put to him that the accused had replied “Chinese medicine” when he first asked the accused about the contents. He maintained that the accused said it was “nothing” to his first two questions about the contents. He also did not agree that the accused’s paleness could be due to his fairness of complexion. He said that and demonstrated in court how the accused had blinked nervously. He said it appeared that the accused did not know what to do. He agreed there was no other strange behaviour.",
      "4": "Sgt John Cheong Ging Thow arrived at Holding Room D63 at about 5.25pm. He was briefed by the police officers. He saw the accused and approached him. He checked his waist band and touched it. It was soft. He then recited his questioning and the answers of the accused. Counsel did not challenge the voluntary nature of the answers of the accused. Sgt John Cheong said he asked the accused what the contents were. The accused kept quiet. He asked him again in English, to which the accused replied: “drugs”. He said the accused pointed to the bags in his thighs. Sgt Cheong then asked him who had asked him to carry the drugs and the accused replied that it was an Australian by the name “John”. Sgt John Cheong said that he recorded the conversation in his pocket diary, which he read in court and which counsel for the Defence examined. He said he recorded thus: “On questioning him the male Chinese admitted he is carrying drugs for one Australian named John.” The sergeant stated in evidence that he did not tell IO Chew Khai Chow about this conversation and that was the reason why he did not mention this conversation in his statement at the preliminary inquiry. Sgt John Cheong also said in evidence that he asked the accused if he knew the punishment for carrying drugs. At first the accused kept quiet. He then asked him if he knew the sentence or not. The accused then said: “Hang”. In cross-examination, Sgt John Cheong denied defence suggestion that the accused had said that he was told that he was carrying Chinese medicine.",
      "5": "The police officers then escorted the accused to the airport police station. From there he was escorted to the Central Narcotics Bureau where he was handed over to Narcotics Officer Chew Khai Chow. The accused was still strapped with the bulges at his waistband and at his thighs. At about 9.15pm IO Chew Khai Chow arranged for the accused to be photographed. The photographs produced in court showed bags of powdery substances strapped round his waistband and round his thighs with thigh guards. We need to refer specifically to the packages strapped round the accused’s waist and thighs. IO Chew marked as “GAL-1” the dark blue long pants with a white cloth containing whitish substance, sewn round the waistline. He also marked the two white cloth bags tied round the thighs with thigh guards which he marked as “GAL-2” and “GAL-3”. Evidence was led to the effect that IO Chew submitted these three exhibits for analysis by principal scientific officer, Dr Chow Shui Tse. Dr Chow Shui Tse stated in evidence that he found that the contents of the three exhibits to be diamorphine with a total nett weight of not less than 1,269.8g. The remains of these three exhibits after analysis were admitted at the trial as Exhs P23, P24 and P25. He was not cross-examined by the Defence.",
      "6": "IO Chew said he took a then s 121(6) Criminal Procedure Code statement from the accused between 12.20am and 1.30am on 21 December 1986. As the voluntariness of the statement was accepted by the Defence, we admitted the statement by which the accused stated as follows:",
      "7": "The “Roland Yeo” referred to by the accused was one Yeo Thian Kwee who was arrested by CNB officers on 21 December 1986. He gave evidence, after which he was cross-examined. It was put to him that he masterminded the whole transaction, that he arranged for the concealment of what he said were Chinese herbs for which very high import tax was payable in Australia, that he and one Joe, a white Australian, had met the accused at the Race Course Food Centre at about 5.00am on 20 December 1986, that they strapped him and concealed the substance in the public toilet there and that he had prearranged his alibis to escape any involvement. It was also put to him that he had taught his wife to perjure herself by saying that he was at home in the morning of 20 December 1986. Yeo denied all these suggestions.",
      "8": "Yeo Thian Kwee, in evidence, said he had known the accused for about ten years. He came to know the accused when he was a salesman of electronic goods. They used to visit bars and lounge for drinks. The last time they had drinks together was in November 1986. He firmly stated that since November 1986 he had not met the accused till his arrest by CNB officers on 21 December 1986. He said the accused, who used to borrow money from him, owed him $40 to $50. He gave evidence of his movements and what he did on 19 and 20 December 1986. He said that on 19 December 1986 he left home at about 9.30am. He took a taxi to a friend’s office at Bukit Merah Central. At that office he met his other friends known as Bala alias Seow Kian Chew and one Phua. Yeo said he remained in that office until 3.00 to 4.00pm. After that he went to the coffeeshop below the office for drinks with his friends known as Ng, Khoo and Wee. They all remained in the coffeeshop till 7.00pm after which he left for home, arriving there at about 8.00pm. He said he never left home until the next day.",
      "9": "On the following day, he said he had breakfast at home. His mistress left home at about 10.00am for work. He left home at about 12.00pm, taking a bus to the Jurong Bus Interchange where he took another bus for Selegie Road. His friends had arranged the previous day for drinks since this was a Saturday afternoon. He said he arrived at a coffeeshop beside the Rex cinema at about 2.00pm. There he met his friends Ng and Wee. Another friend known to him as Khoo joined them later. They left the coffeeshop at about 5.00 to 6.00pm for Petain Road, where at another coffee shop he had two more drinks with his friends. After that he left with his friend Khoo in his station wagon at about 6.30pm for Bishan Road. At Bishan Road, he collected his young son from his sister-in-law’s house. His friend, Khoo, sent them home. He said his friend, Khoo, remained with them until after the Chinese news on television at about 8.30pm. Yeo said he was at home with his young son until his mistress returned home at about 10.00pm. After that he went to bed. In going about, Yeo used an artificial limb as his right leg had been amputated.",
      "10": "Yeo Thian Kwee’s wife, who had just started work in a hotel as a probationary administrative officer, gave evidence which substantially supported Yeo’s evidence that on 19 December 1986 he had returned home by about 7.00pm and had remained in his flat until about 9.30am the following Saturday morning when she left for work. She said she remembered this because it was a Saturday and he did not, as usual, go to work early. She had prepared his breakfast and had woken him up. She had reminded him to fetch their son from their baby-sitter who was her sister-in-law. Whereas the accused in his statement alleged that Yeo Thian Kwee was miles away from home at Race Course Road at about 5.00am on 20 December 1986, Yeo’s wife confirmed that Yeo was at home and had spent the night there waking up only at about 9.00am. In her statement to IO Chew on 6 January 1987 and at the preliminary inquiry, she had claimed that Yeo Thian Kwee was at home with her on 19 December 1986 up to 4.00pm. She amended this in her evidence before us. She said she really did not know the exact time he had left home on the morning of 19 December 1986. She claimed she was very confused when she made the statement. However, she maintained that what she said about the presence of the accused on the Saturday morning of 20 December 1986 was correct.",
      "11": "Seow Kian Chiew, a trader who was also known as “Bala” to his friends, said he had been a friend of Yeo Thian Kwee’s since 1979. On 19 December 1986 at about 11.00am he went to the office of Soon Heng Industrial Company at the Bukit Merah Centre. There he met Yeo Thian Kwee, a Mr Ng, a Mr Phua and a Mr Wee. The company was run by a Mr Foo, a friend of Phua. He identified Yeo, Phua and Ng in court. He said he had not seen Mr Wee after that day. At about 2.00pm Yeo Thian Kwee and Wee left the office but they returned to the office at about 5.00pm where they remained until 6.00pm. Shortly thereafter, he went with Yeo Thian Kwee, Phua, Wee and Ng to a coffeeshop below the office and had coffee for about half an hour. Seow said he and Phua left, after which he never met Yeo Thian Kwee again.",
      "12": "Seow said he had known the accused since 1978 when he met him in a car dealer’s shop. He last saw him in 1985 after which he had no further contact with the accused.",
      "13": "Phua Keng Swee, the sole proprietor of a paint shop when he gave evidence, said that he had worked as a salesman in Soon Heng Industrial Company, a garment factory, for less than two months from December 1986. By 19 December 1986 he had seen Yeo Thian Kwee four or five times. He said that on 19 December 1986 he went to work and at the office he saw Yeo Thian Kwee, Wee and Ng. He identified Ng as Ng Ching Yong but he said he had not seen Wee since that day. He left work for home that day at about 5.00pm with “Bala”. He did not pay attention if Yeo Thian Kwee was in the office the whole day. He did not know the accused.",
      "14": "Yeo Thian Kwee’s movements on Friday, 19 December 1986, between 2.00 and 3.00pm and 7.00pm and Saturday, 20 December 1986, from about 2.00pm and 8.30pm were confirmed by Siah Gim Huat, also known as “Khoo”, a friend of Yeo Thian Kwee. He was in the export and import business. His evidence confirmed that he was with Yeo Thian Kwee on 19 December 1986 between the hours stated. He also said they had drinks together the following afternoon and was in the company of Yeo Thian Kwee until he left him at his flat after the television Chinese news at about 8.30pm.",
      "15": "Ng Ching Yong, an estate agent, gave evidence that he spent part of the afternoon and evening of 19 December 1986 in the company of Yeo Thian Kwee and had drinks with him the following Saturday afternoon in a coffeeshop near the Rex cinema.",
      "16": "Counsel for the accused in the course of the cross-examination of Yeo Thian Kwee also put to him that he had given the accused A$342 and S$204 as travelling expenses at the Race Course Food Centre public toilet and had assured the accused that he would be paid A$10,000 in Australia, failing which Yeo Thian Kwee would himself pay him. Yeo denied these suggestions. It was also put to Yeo that from the Race Course Food Centre, after he had put on the trousers and a coat, all three of them went to the Hyde Park Cafe, where Yeo handed him the passport and the air ticket. Defence counsel also suggested that from the Hyde Park Cafe, Yeo and Joe took him to see a doctor at the Tokyo Dispensary, after which they returned to the Hyde Park Cafe. It was also part of the defence case that Yeo and Joe left the cafe at about 11.00am and that before leaving, Yeo had told him to wait at the cafe until about 1.00pm when a friend of Yeo’s would take him to the airport to take the BA flight that afternoon.",
      "17": "With regard to these visits to the Hyde Park Cafe on 20 December 1986, Prosecution led the evidence of Hoong Bee Huay who was working as a cashier-cum-supervisor at the cafe, which was her father’s restaurant. She had worked at the cafe from 1984 until April 1987. She said that the accused and Yeo Thian Kwee, both of whom she identified, had patronised her cafe. But she said that the last time they or either of them patronised her cafe was in early November 1986. She was positive that neither the accused nor Yeo Thian Kwee had patronised her cafe on either 19 or 20 December 1986. She confirmed that on 20 December 1986 from 10.00am to 10.00pm she had remained throughout in the cafe. She took her lunch at the cafe. She did not see the accused nor Yeo Thian Kwee. In cross-examination, she denied that the accused had come to the cafe with a white Australian at about 10.00am on 20 December 1986. She also denied that Yeo and the Australian had left at about 11.00am and that the accused left the cafe at about 1.00pm.",
      "18": "At the close of the case for the Prosecution, the Defence did not make any submission. We were of the view that Prosecution had made out a prima facie case which, if unrebutted, would warrant a conviction of the charges in the alternative and we called upon the accused to enter upon his defence. We administered the usual allocution. The accused elected to give evidence on oath.",
      "19": "The accused said that he had been a taxi driver for 22 years. He had known Yeo Thian Kwee for about ten years before his arrest. They had gone out frequently for drinks. He has two daughters, Goh Siew Yong and Goh Siew Mei who were aged 25 and 23 at the time of his arrest. They were suffering from mental illnesses and were treated. He used to borrow money from Yeo Thian Kwee to pay for the medical expenses. Yeo had introduced to him two whites known as John and Joe whom he was told were Australians.",
      "20": "About three months before his arrest, the accused was offered by Yeo Thian Kwee in the presence of John an opportunity to make big money by carrying something to Australia. He wanted to know more and was told by Yeo Thian Kwee not to worry but to wait for his instructions. He trusted Yeo Thian Kwee. On 1 December 1986 Yeo Thian Kwee got him to sign the application form for the visa and took away his passport. At about 11.00am on 19 December 1986 he went to Hyde Park Cafe, as arranged by Yeo Thian Kwee, and collected from him the nylon travelling bag, Exh P34. Yeo told him to wait for further instructions. At about 11.00pm that night, Yeo told him that he was going to Australia and instructed him to meet him at the Race Course Food Centre at 5.00am the following Saturday morning. He went there at the appointed time and met both Yeo Thian Kwee and Joe, the other white Australian. Yeo had a plastic bag which contained a pair of long trousers with two packets sewn round the waist band, Yeo having earlier taken his measurements for the trousers. The accused also saw two other packets and a jacket. He asked both Yeo Thian Kwee and Joe whether the thing he was about to carry was illegal and Yeo told him that it was Chinese medicine. He then went into the public toilet at the food centre with Joe who helped to strap the two packets onto his thighs and he put on the trousers. He came out of the toilet and Yeo gave him the jacket to put on. Yeo also gave him A$342 and $204 for his expenses.",
      "21": "The accused, though believing the contents to be Chinese medicine, again questioned Yeo if it was dangerous or an offence for him to carry that thing. The accused said that Yeo Thian Kwee told him that it was not an offence in Singapore but it would be taxed in Australia. Yeo also said that he would be met on arrival by someone who would be carrying a cardboard bearing his name. Yeo Thian Kwee also promised the accused would be paid A$10,000 in Australia and that Yeo would pay him if he was not paid in Australia.",
      "22": "The three of them went to the Hyde Park Cafe at about 10.00am. He carried his travelling bag with him. They left it in the cafe and they took him to consult a doctor for his treatment of his aches and pains. After that they returned to the cafe. At about 11.00am both Yeo and Joe left, and the accused was told a friend of Yeo’s would take him to the airport from the cafe at about 1.00pm. At about 1.00pm Yeo’s friend came in a Honda car and drove him to the airport.",
      "23": "At the departure Passenger Holding Room D63, he was frisked by PC Zainudin and was detained. When asked at first, he first told the police constable “nothing” but later he told him it was Chinese medicine which John had arranged for him to carry to Australia. Later, to Sgt John Cheong, the accused said he told him it was Chinese medicine and that it was John who arranged for him to carry it to Australia. As for the contents, he had told the sergeant that he was not sure of the contents. He said the sergeant did not ask him if he knew about the punishment for carrying drugs. He was asked to explain why he did not state that it was John who asked him to carry Chinese medicine in his then s 121(6) Criminal Procedure Code statement. He claimed that he had told IO Chew Khai Chow that it was Chinese medicine and that it was John who arranged for him to carry the packets to Australia. When referred to the evidence of Hoong Bee Huay to the effect that she did not see Yeo Thian Kwee and the accused patronising the cafe either on 19 or 20 December 1986 the accused suggested that she could be mistaken or that she was quite friendly with Yeo Thian Kwee.",
      "24": "Accordingly, the sole question of fact before us turned on the knowledge of the accused and it was whether he knew he was carrying heroin or whether he believed, as he claimed, that he was merely carrying Chinese medicine to Australia. Having considered the entire evidence, we were left in no doubt that he knew he was carrying heroin. We did not believe him when he claimed that he believed he was merely carrying Chinese medicine. We found that after his arrest he admitted to Sgt John Cheong that he was carrying drugs to Australia and that he was pale and nervous. If he was merely carrying Chinese medicine to Australia he had no reason to be nervous. He also did not mention in his then s 121(6) statement that he believed he was merely carrying Chinese medicine to Australia. In his statement he stated that Yeo Thian Kwee and John never told him “what was the thing” he was supposed to carry. We did not believe his claim that he had told IO Chew Khai Chow that it was “John” who arranged for him to carry Chinese medicine to Australia. We found the version of the accused about carrying Chinese medicine to Australia merely to evade tax there quite incredible. We refer to his evidence about the role of Yeo Thian Kwee, particularly the events on the morning of 20 December 1986 at the Race Course Food Centre and their visits to the Hyde Park Cafe. We were convinced he was not telling the truth. In addition to the denial of Yeo Thian Kwee, and the confirmation of Yeo’s wife that he was at home that morning, we also accept the evidence of Hoong Bee Huay that the accused, Yeo Thian Kwee and John or any of them did not patronise the Hyde Park Cafe on 20 December 1986 and that the last time the accused and Yeo Thian Kwee patronised the cafe was in November 1986.",
      "25": "Accordingly, we convicted the accused of the offence of attempting to export to Australia the diamorphine in the quantity as charged contrary to s 7 read with s 12 of the Act. We stood down the alternative charge. We sentenced him to death."
    }
  },
  {
    "reference": ["[1989] 1 SLR(R) 80", "[1989] SGHC 9"],
    "date": "03 February 1989",
    "court": "High Court",
    "coram": ["T S Sinnathuray J", "Joseph Grimberg JC"],
    "counsel": {
      "prosecution": ["Lee Sing Lit"],
      "defence": ["Raj Kumar"]
    },
    "parties": ["Public Prosecutor", "Kadir bin Awang"],
    "paragraphs": {
      "1": "Kadir bin Awang (“the accused”) was charged with having imported into Singapore, at about 5.45am on or about 9 October 1986, in a train alongside the Ayer Rajah Expressway, 33 packets of a substance containing not less than 50.61g of diamorphine, without authorisation, an offence under s 7 of the Misuse of Drugs Act (Cap 185).",
      "2": "It was the Prosecution’s case that the accused had gone to Malaysia with Jamala bte Hashim (“Jamala”) on 1 October 1986, that the drugs had been purchased by the accused in Penang and that the accused and Jamala had returned to Singapore by train from Johore Bahru early on the morning of 9 October. As the train reached a stretch of the railway line at Lower Delta Road, adjacent to the Ayer Rajah Expressway, the accused had thrown a package containing the drugs out of the train window. The package was retrieved by Yusoff bin Mohd Noor (“Yusoff”), who had been waiting on or near an overhead bridge. Yusoff took the package to a flat known as Block 14, #02-288, Telok Blangah Crescent (“the flat”), where he was joined later by the accused and Jamala.",
      "3": "The Prosecution led evidence that on the afternoon of 9 October 1986, Senior Narcotics Officer Jamaludin bin Salleh (“SNO Jamaludin”) and four officers attached to the enforcement division, Central Narcotics Bureau (“CNB”) set out to raid the flat. At about 5.30pm, SNO Jamaludin and three of his men knocked on the door of the flat; a fourth officer, ANO Lim Tze Chien was stationed on the ground floor, at the rear of Block 14, in order to keep the window of the flat under observation.",
      "4": "There was no response to repeated knocking on the door. One of the officers peered under it and saw that the flat was occupied. The officers continued knocking, but without result. SNO Jamaludin and one of his officers went to the Radin Mas police post, situated close by, to secure a crowbar, leaving ANOs Riduan bin Mohamed Noor and Lim Tian Siew at the door of the flat.",
      "5": "ANO Riduan climbed onto a stool which he found in the corridor, and broke a plywood panel above the door of the flat. He looked in and saw Kadir bin Awang squatting on the floor, at the end of a bed. ANO Riduan ordered the accused to open the door, which he duly did. ANOs Riduan and Lim Tian Siew entered the one-room, L-shaped flat and saw that it held two other occupants, Jamala and Yusoff. The accused and Yusoff were searched, and nothing in the way of drugs or weapons was found on them.",
      "6": "SNO Jamaludin and NO Ho Thiam Huat, the officer who accompanied him to the police post, returned to the flat shortly afterwards. SNO Jamaludin ordered ANOs Riduan and Ho to conduct a search. ANO Riduan found a quantity of vegetable matter and a rolled-up $1 note on the floor, near a bed. The vegetable matter was later ascertained to be cannabis, and the dollar note was found to be stained with diamorphine.",
      "7": "One of the pieces of furniture in the flat was a white cupboard, with a pair of drawers at its foot. ANO Riduan found a set of keys in the cupboard. He asked who owned them, and the accused acknowledged that the keys were his. ANO Riduan then asked to whom the cupboard belonged, and the accused said that it belonged to him. ANO Riduan opened one of the drawers at the foot of the cupboard with a key and found in it a plastic bag and a cigarette carton. The bag contained 20 sachets, and the carton 13 smaller sachets, of a granular substance which, upon later analysis, was found to contain a total of 50.61g of diamorphine.",
      "8": "After the discovery of the drugs and the money in the drawer, the accused, who had been seen squatting, handcuffed to Yusoff, told SNO Jamaludin that he had something to say. The SNO ordered the handcuff to be unsecured and, as he and the accused walked towards the kitchen area of the flat, the accused made a statement (“the oral statement”) to SNO Jamaludin.",
      "9": "As this evidence emerged, counsel for the accused rose and said that he had no notice of the oral statement and that SNO Jamaludin had made no reference to it in his evidence before the preliminary inquiry. If the accused had made a statement, and if it allegedly amounted to a confession, said counsel, he was objecting to it on the grounds that it was not voluntarily made. The learned deputy public prosecutor (“the DPP”) responded that the oral statement did not amount to a confession “in regard to this case”. We nevertheless ruled that we would deal with the admissibility of the oral statement in a voir dire in which we would also rule on the admissibility of a statement (“the written statement”) allegedly made later by the accused pursuant to s 122(6) of the Criminal Procedure Code (Cap 68).",
      "10": "During the search of the flat, Jamala’s passport was recovered. It showed that she had entered Malaysia via Johore Bahru on 1 October 1986, and that she had returned to Singapore on 9 October.",
      "11": "At about 6.15pm, the accused, Jamala and Yusoff were escorted to CNB. They arrived there at about 6.30pm and remained in the general office until about 8.40pm when they were both taken to the Singapore General Hospital for medical examinations. The accused was brought back to CNB from his medical examination at about 10.15pm, and at about 10.35pm he was charged, jointly with Jamala in furtherance of the common intention of them both, with having imported 33 packets of diamorphine at about 5.45am that morning at Keppel Road Railway Station without authorisation, and in contravention of s 5 of the Misuse of Drugs Act, read with s 34 of the Penal Code.",
      "12": "Little more than six weeks later, namely, on 1 December 1986, Jamala was produced in court. The charge against her was withdrawn, and she was discharged, her discharge amounting to an acquittal. Shortly after her acquittal she was served with a subpoena to give evidence on behalf of the Prosecution at the preliminary inquiry, which was held on 8 July 1987. She duly did so.",
      "13": "She also gave evidence against the accused at the trial before us. Her evidence was crucial to the case for the Prosecution.",
      "14": "Jamala said, in her examination-in-chief, that she first met the accused in June 1986, and that her relationship with him became close. She was on drugs and obtained her supply from the accused. On 1 October 1986, she went to Penang with the accused on holiday at his invitation. They lived in a hotel, she thought, for about three days, and on one of those days the accused told her that he was going downstairs, to see a friend. Thereupon, Jamala went to the window of her room, which was adjacent to the accused’s room on the fourth floor of the hotel, from which she could see the hotel carpark below, and beyond it, the street on which the hotel was located.",
      "15": "She saw the accused in the carpark. He took out “a stack of money”, 2in thick, and handed it to his friend, who had driven up in a car, in exchange for a plastic bag. The accused then came up to her room, gave her a “straw” and told her that they would be going to Kuala Lumpur, which they duly did.",
      "16": "In Kuala Lumpur, the accused and Jamala shared the same hotel room. They stayed for about two days, went to Malacca for half a day and then proceeded to Johore Bahru where they checked into a hotel and stayed for about three days in the same room.",
      "17": "On the second of those three days, the accused opened the plastic bag which she had seen him receive in the carpark in Penang. He took from it a parcel wrapped in newspaper, which contained packets of what looked like the drugs she was in the habit of consuming, and which the accused called “smack”. They both consumed some “smack”, after which the accused told Jamala that they would be returning to Singapore the following day. The accused instructed Jamala to repack the drugs. In the course of doing so she counted 33 packets. The accused and Jamala quarrelled because she was afraid and was reluctant to return to Singapore with him. The quarrel continued for some time, during the course of which the accused struck Jamala across the back with a coat-hanger.",
      "18": "In the event, at about 5.00am the next morning, 9 October 1986, the accused and Jamala proceeded to the railway station in Johore Bahru, Jamala carrying the packages containing the drugs in her suitcase, at the accused’s insistence. Upon the arrival of the Singapore train at about 5.30am, they boarded it after a customs’ check, Jamala sitting three rows behind the accused, each occupying a window seat on the right-hand side of an empty carriage.",
      "19": "Following the train’s departure from Johore Bahru, the accused went to Jamala’s seat and asked for the package. She got it out of her suitcase and gave it to him. He then asked her for a plastic bag and she gave him one into which she had packed her shoes. The accused returned to the seat he had been occupying previously, and Jamala saw him place the package in the plastic bag. As the train alongside the Ayer Rajah Expressway approached an overhead bridge at Lower Delta Road, the accused rose, leant out of the window, signalled to someone outside by pointing with his hand and threw the plastic bag, with the package in it, out of the window just as the train passed the overhead bridge. Jamala saw a person standing “near the overhead bridge” to whom the accused had addressed his signal. She saw that it was Yusoff. She also saw Yusoff respond to the accused’s signal by pointing to the spot at which the accused had pointed just before the package was thrown.",
      "20": "The train proceeded to the railway station at Tanjong Pagar. The accused and Jamala alighted and proceeded to the flat by taxi. Yusoff was already there. The accused asked Yusoff whether he had retrieved the package, to which Yusoff replied in the affirmative. At noon the accused gave Jamala the key to the flat and the key to the cupboard, saying that he was going out. Jamala went to sleep and was awakened by the CNB officers knocking at the door. They took possession of Jamala’s passport, but not that of the accused, which they left on the bed. She had seen the accused’s passport on their journey to Penang. It bore the accused’s photograph, but a name which was not his.",
      "21": "Before the conclusion of Jamala’s evidence-in-chief, counsel for the Defence applied for an adjournment in order to take instructions on the grounds that Jamala had given a mass of evidence, in particular concerning events which occurred in Malaysia, which had not featured in the story she told at the preliminary inquiry. Counsel’s application was wholly justified and we readily granted an adjournment of a day’s duration.",
      "22": "When the trial resumed, Jamala continued her evidence. She told us that after her discharge on 1 December 1986, the accused’s father offered her $10,000 “not to go to court”; that at or about the same time, she was assaulted by three young Chinese who called out her name, asked her if she knew the accused, and beat her up; and, that a week before the trial commenced, she was accosted at Telok Blangah Market by the accused’s younger brother, Jamil, and told that if she gave evidence “and anything happened” to the accused, she would suffer the same fate.",
      "23": "Counsel objected to the admissibility of the alleged oral and written statements on grounds which boiled down to the following:\n(a)     that the accused made no oral statement;\n(b)     alternatively, if he did make an oral statement, it was not made voluntarily in that the accused was assaulted by SNO Jamaludin and ANO Lim Tze Chien, shortly after the SNO entered the flat upon his return from Radin Mas;\n(c)     the accused made no written statement, SNO Jamaludin having been the author of a written statement signed by the accused;\n(d)     alternatively, if the accused did make a written statement:\n(i)       it was not recorded in compliance with the provisions of s 122(6); and\n(ii)       immediately prior to the recording of the written statement, inducements and promises were offered to the accused while he was seated at SNO Jamaludin’s table; and\n(e)     that even if there was no threat, promise or inducement leading to the recording of the written statement, the accused’s state of mind, as a result of the consumption of drugs, was such that we should exercise our discretion against the admission of the statement.",
      "24": "As to the alleged assaults, the accused’s evidence was that when SNO Jamaludin entered the flat at about 5.00pm on 9 October, he was angry. That, we find, is perfectly possible. The occupants of the flat had refused the CNB officers entry for some time and SNO Jamaludin had been obliged to go and obtain a crowbar at Radin Mas police post. When he returned he found that two of his officers had already been let in. It is therefore conceivable that he was not in a particularly agreeable frame of mind. However, we did not believe that virtually his first action upon entering the flat was to strike the accused two or three blows in the stomach. As for the slaps and push alleged to have been delivered by ANO Lim Tze Chien, we found that he was the officer who was posted to the rear of the building, on the ground floor and that when SNO Jamaludin entered the flat, ANO Lim was still at that post and could not have assaulted the accused.",
      "25": "We are bound to state that although ANO Lim Tze Chien was present in court, as were SNO Jamaludin’s other officers, neither ANO Lim Tze Chien (who was identified by the accused as the officer who slapped and pushed him) nor those other officers were called as witnesses in the voir dire to rebut the accused’s allegations. This was an imprudent decision on the part of the learned DPP, and in so saying we have in mind the judgments of the Federal Court in Tan Too Kia v PP [1980] 2 MLJ 187 and that of Choor Singh J in PP v Ibrahim bin Mastari [1965–1967] SLR(R) 211; [1980] 2 MLJ 188 reported in the same [MLJ] volume at 188. However, these cases do not say that the failure to call a witness in rebuttal at a voir dire is fatal to the admission of a statement. In our view, such an omission simply imposes upon the court a duty to scrutinise the evidence as to voluntariness with very special care. This we did. We also bore in mind the evidence of Jamala, who gave her evidence before the voir dire. She said that she did not see SNO Jamaludin assault the accused upon entering the flat, and we believed her.",
      "26": "After the accused, Jamala and Yusoff were escorted to CNB from the flat, they remained in the general office for some two hours before being taken to the Singapore General Hospital for their respective medical examinations. There was no criticism of the treatment the accused received during this period, and he conceded that he was not threatened in any way, nor was he the recipient of any promise or inducement.",
      "27": "Dr John Richard Isaac, who carried out examinations of the accused both before and after the written voir dire, but gave evidence earlier. He did not bring his clinical notes to court, but Dr Isaac said that he found no sign of injury on the accused, and that the accused did not complain of any assault. Although Dr Isaac conceded that he would only have observed bruises if the accused was struck heavy blows, we were satisfied from our observation of the accused and our assessment of him when he gave evidence in the voir dire, that he would have said so to Dr Isaac in the plainest of terms had he been assaulted earlier in the day.",
      "28": "In the result, our unreserved conclusion was that the accused’s account of the alleged assaults in the flat at the hands of SNO Jamaludin and ANO Lim Tze Chien was untrue. We found that the accused was not assaulted and therefore had no reason to fear further assault.",
      "29": "It was asserted by the accused that in the twenty minutes or so between the time he was brought back from his medical examination and the time he began making his written statement, he was seated at SNO Jamaludin’s desk and that he received certain inducements and promises, as well as being taunted by having a sachet of diamorphine dangled in front of him. SNO Jamaludin’s evidence was that at that time he was engaged in sorting out and marking the exhibits in the case and that he offered no blandishments of any kind to the accused. We believed the SNO’s version of what took place and rejected the accused’s account of what transpired during the period in question.",
      "30": "In so far as it was alleged that the written statement was not recorded in compliance with s 122(6) of the Criminal Procedure Code (Cap 68), a careful assessment of the evidence drove us to the conclusion that the Prosecution had proved beyond reasonable doubt that the requirements of the section were complied with. We were satisfied that both the charge and the warning were interpreted and explained to the accused, and we were particularly impressed with the evidence of the interpreter, Abdul Razak, in these respects. The accused’s evidence was that SNO Jamaludin was the author of the statement; that none of it fell from the lips of the accused; that he had signed the paper (P14) bearing the handwritten charge, the warning, and the acknowledgements four times in one fell swoop, at the behest of SNO Jamaludin because he was fed up and wished to be taken down to the lock-up. We regarded this account as outlandish, and we disbelieved it, preferring the evidence of SNO Jamaludin and Abdul Razak.",
      "31": "As for the submission that we should exercise our discretion and keep the written statement out on the grounds that the accused was not in a fit state to make it due to the effects of drug consumption, Dr Isaac said that the accused had seemed well and alert. He did not observe withdrawal symptoms, and when asked if he had any complaints, the accused had answered in the negative. If the accused had exhibited withdrawal symptoms, said Dr Isaac, he would have seen them and recorded the fact in his report.",
      "32": "The accused’s objections to the admissibility of the oral and written statements failed. We concluded that the accused had made both the oral and written statements, and that he had made them voluntarily. We ruled that both statements be admitted into evidence.",
      "33": "SNO Jamaludin gave evidence that the oral statement, made to him by the accused in the flat just after 6.00pm on 9 October 1986, was in the following terms:",
      "34": "The written statement, which was recorded some four and a half hours later went as follows:",
      "35": "Notwithstanding the admission of the statements in evidence, counsel for the accused requested that Dr Isaac be recalled, since counsel wished to address the issue of the probative value of the statements. Dr Isaac was duly produced for cross-examination by counsel. This time he brought copies of his clinical notes with him. At the time he examined the accused, Dr Isaac had been qualified for four years, and had been attached at various times to Singapore General Hospital, Tan Tock Seng Hospital and National University Hospital. He had performed duties as a medical officer with general medical, as opposed to specialist, training.",
      "36": "Dr Isaac thought that the prestatement examination of the accused would have taken him about ten minutes. There was no request on the part of CNB for the accused to be examined for the effect of drugs, although the form which had accompanied the accused stated that he had been involved in a trafficking offence. Dr Isaac said that in the case of a habitual heavy user, he would expect withdrawal symptoms to begin to appear between five and ten hours after consumption, and that the symptoms would be at their worst between 24 and 48 hours after consumption. Dr Isaac detected no withdrawal symptoms, but he conceded that he might have looked more carefully if he had noticed that the accused was an abuser. He did not look for these symptoms as a matter of routine, but such symptoms are very overt. He would have observed them if they were present, and he would have noted them down.",
      "37": "Dr Isaac said that withdrawal symptoms include anxiety, hostility, disorientation, sweatiness, abdominal pains, muscle aches, vomiting and nausea. He was honest enough to say that he could not state what symptoms would be exhibited at the onset of withdrawal, that is to say during the period between five and ten hours after consumption, because of his lack of experience of this type of problem, and because symptoms during onset are more subtle. Although the accused appeared alert and his general condition was good, Dr Isaac conceded that a patient who has taken drugs can appear perfectly lucid. The accused’s nasal passages had appeared to be “a bit wet”. Dr Isaac agreed that a running nose is one of the symptoms of withdrawal.",
      "38": "In answer to a question from the court, Dr Isaac expressed the view that having regard to his observation of the accused during the prestatement examination, a statement made by the accused immediately thereafter would have been reliable, in the sense that it was not likely to have been affected by the consumption of drugs.",
      "39": "Some six or seven days into the trial, we were told by the learned DPP that Yusoff (who, on the case for the Prosecution, had recovered the package containing the drugs and taken it back to the flat) would not be called as a prosecution witness because he had declined to give evidence. This came as no surprise since Yusoff had not been a witness at the preliminary inquiry. The DPP informed us that Yusoff, although not in court, would be offered as a witness to the Defence. We directed that Yusoff be traced and brought to court, so that he might be interviewed by counsel for the Defence.",
      "40": "Two days later, we were told that Yusoff had been seen by SNO Jamaludin the previous day, and that he had “promised” to turn up in court but had failed to do so. No attempt had been made to serve him with a subpoena. The DPP was directed to effect service of a subpoena on Yusoff to the intent that he be produced in court on 30 January so that counsel for the Defence might interview him.",
      "41": "At the close of the case for the Prosecution, counsel submitted that the accused should not be called upon to make his defence. He submitted that, on the Prosecution’s own case, it was Jamala who had imported the drugs into Singapore, not the accused; her evidence was incredible and was radically different from the evidence she had given at the preliminary inquiry; the Prosecution had neither called nor made available the witness Yusoff, a vital link in the prosecution case; and the Prosecution had in any event failed to prove that the drugs found in the flat were the drugs that Jamala had imported.",
      "42": "We rejected counsel’s submission. There was evidence, which was not inherently incredible, and which if accurate, established that Jamala had carried the drugs onto the train at Johore Bahru as the accused’s agent and/or under duress applied by him; that once the train was in Singapore the drugs were taken by the accused from Jamala, and thrown out of the train at Lower Delta; and that those drugs were retrieved by Yusoff and taken to the flat, where they were seized by the CNB officers. We were of the view that the Haw Tua Tau v PP [1981–1982] SLR(R) 133 test was satisfied, and called upon the accused to make his defence to the charge.",
      "43": "The accused, who is 42, gave evidence on his own behalf. He told us that he began taking drugs in 1977, and was arrested for the first time in 1978. He was confined at DRC for three periods, the last of which ended in May or June 1985, at which time he was placed on the “day release scheme”. This scheme enabled him to work outside the centre but required him to return at night.",
      "44": "He absconded soon after he was placed on the scheme, after which he had no fixed address. He did not return to the flat in which his wife and two unmarried children lived; nor did he return to his mother’s apartment, opposite the flat, because his mother had told him that CNB officers were looking for him. Between the time he absconded in June/July 1985 and the date of his arrest, 9 October 1986, he took casual jobs as a labourer, slept rough, earned between $200 and $300 a week, and spent the greater part of it on heroin, ganja, a drug called “Heromin 5” (which he used to reduce withdrawal symptoms), and beer.",
      "45": "On 8 October 1986, the accused had received $300 as wages for working as a stevedore for four or five days on board a Japanese vessel, which was moored at the Quarantine Anchorage. He had been employed by a Chinese contractor, whose name he could not remember. He did not know the name of the vessel. He had eaten and slept on board, having been taken to the vessel by bumboat from Clifford Pier. His work on board ended on 8 October.",
      "46": "The accused remembered waking up at about 7.00am on the morning of 9 October 1986. He found himself at the Esplanade. He had consumed “smack” and ganja the previous night, after returning ashore from his job on the ship, and had also drunk beer, becoming very “high”. He described himself, in English, as having been in a state of “havoc”. He could not recall how he had got to the Esplanade, but having awaken at 7.00am he washed his face at a public toilet, and had a cup of coffee at a stall in the Satay Club. He then took a bus to a construction site at Palmer Road, with a view to finding work.",
      "47": "There was no work available. He went to a canteen at the worksite, and fell in with a group of Thai, Malaysian and Bangladeshi labourers who were gambling at cards. The accused told us that he is a lucky gambler, and with the $100 or so that was left after his binge the previous night, he bought a couple of sticks of ganja, and won over $1,000, gambling between 9.00am and 2.00pm. He decided to go to his mother’s apartment at Telok Blangah Crescent in order to give her some money.",
      "48": "When he got there, the door to his mother’s apartment was ajar, and he could see relatives from Segamat inside. He turned on his heels, walked a few steps across the corridor to the flat and knocked on the door. It was opened by Yusoff, who let him in.",
      "49": "Upon entering the flat, he saw Jamala. This was only the second time that he had laid eyes on her, the first having been in or about June/July 1986. The accused sat on the floor with Yusoff and Jamala, and they took heroin together, using a rolled up $1 note to “chase the dragon”. Later, there was knocking at the door. The accused let in two CNB officers after the panel above the door had been broken. Later SNO Jamaludin had entered, armed with a crowbar. He approached the accused, who was squatting, hauled him up by his right arm and struck him two or three blows in the stomach, saying, “Why did you not open the door earlier?” At the same time, SNO Lim Tze Chien slapped him across the back a couple of times and pushed him.",
      "50": "The CNB officers searched the flat. They seized the diamorphine from the drawer, and the rolled up $1 note and some ganja off the floor. Before ANO Riduan searched the cupboard, he did not ask who owned the keys he found, or whose cupboard it was. The accused made no oral statement to SNO Jamaludin and he was not asked for his passport. He did not have an identity card, let alone a passport.",
      "51": "Jamala, Yusoff and the accused were escorted out of the flat, in that order. In the corridor, the accused shouted for his mother three or four times, and when she appeared he tossed his wallet containing his morning’s winnings to her, since after all he had come to visit her in the first place in order to give her money. The wallet landed on the floor. As the accused’s mother was about to pick it up, SNO Jamaludin pushed her aside, and retrieved it with his left hand. When the accused’s mother tried to take it from him, he took it from his left hand into his right hand, and held it out of her reach, pushing her away. SNO Jamaludin, his escorts and their prisoners then went on their way to CNB.",
      "52": "As for his relationship with Yusoff, the accused said that they had first met as inmates of DRC in 1981. There had been two casual meetings in 1983. In March 1986, the accused had gone to visit his mother and saw Yusoff, dressed in a sarong, outside the flat. They had exchanged greetings, and ended up consuming “smack” in the flat, Yusoff having let the accused in. In a nutshell, the accused had not gone to Penang with Jamala on 1 October 1986 and therefore had not returned with her on 9 October. Jamala’s evidence was a total fabrication. The drugs in the flat did not belong to him; nor did the other items, such as a camera and video tapes, that were found in the same drawer as the diamorphine.",
      "53": "The accused called no witnesses. Counsel for the Defence was eventually able to interview Yusoff, and decided not to use him.",
      "54": "The accused’s defence was, essentially, alibi. Despite this, no notice was given on his behalf in accordance with the provisions of s 155 of the Penal Code. However, the DPP took no issue over the absence of the prescribed notice, and we allowed the accused to give evidence in support of his alibi. At the end of the defence case we allowed the DPP to call two witnesses by way of rebuttal of the alibi evidence. Cpt Chua Eng Kiat (PW13) told us that he knew of no instance in his eight years as OC Enforcement, at the Port Master’s Department, of a vessel having worked cargo for up to four or five days in any of the port’s three immigration and quarantine anchorages. A vessel may be worked in these anchorages only if specific permission is granted, and permission is generally granted for a few hours, and then only in exceptional circumstances. The immigration and quarantine anchorages are separated from working anchorages by buoys.",
      "55": "Abdul Rahim bin Mohamed Don (PW14), an assistant public health inspector, said that he has been responsible for public health in the Satay Club area in Empress Place since November 1987. At any rate, during the period since he assumed this responsibility, stalls have opened at 3.00pm and have stayed open until midnight. No stalls have opened for business as early as 7.00am.",
      "56": "Following the conclusion of the closing submissions, we considered the evidence. There were certain features of the prosecution case, which we noted, and of which we took careful account. They were:\n(a)     despite the fact that Jamala’s passport was recovered from the flat, and that at or about the same time the accused told SNO Jamaludin that he had brought the drugs into Singapore from Malaysia that morning, the accused was not asked for the passport he had used, no passport was recovered, and there was no evidence that the accused had disposed of a passport following his return to Singapore. Jamala said that she saw the accused’s passport lying on a bed in the flat after she and the accused had returned, but no member of the raiding party saw it; SNO Jamaludin made no inquiries as to whether a passport had ever been issued to the accused or, if one was issued, whether it had ever been confiscated on any one of the three occasions when the accused was sent to the DRC;\n(b)     SNO Jamaludin returned to the flat after escorting the accused, Jamala and Yusoff to CNB. He did so to supervise the taking of photographs and, according to him, to search for the accused’s passport. He had said nothing about a search for the passport at the preliminary inquiry, and ANO Lim Thian Siew, who accompanied him on this visit to the flat, said that there was no search;\n(c)     Jamala could not remember the name of any one of the four hotels she and the accused had checked into in Malaysia, despite the fact that they had stayed in Penang for (as it emerged) at least four days, and in Johore for three;\n(d)     although they had gone to Penang for a holiday, Jamala spent the best part of her time there in her hotel room, or that of the accused;\n(e)     Jamala said that the accused chose to take possession of, and pay for, the drugs in the carpark of the hotel in Penang in broad daylight, in public view, without even bothering to get into the car in which the accused’s friend had driven up;\n(f)     Jamala was for some reason drawn to the hotel window on the fourth floor at which she remained for some 25min, and from which she was able to observe the two-inch thick stack of notes which the accused passed to his friend in exchange for the bag containing the drugs;\n(g)     despite the fact of having visited Johore Bahru between 40 and 50 occasions in the 15 or so months before October 1986, Jamala was not only unable to name the hotel in that town in which she and the accused stayed, but was also unable to state its location;\n(h)     Jamala was unable to give any explanation, or at any rate any explanation that convinced us, for her numerous previous visits to Johore Bahru, bearing in mind that she neither worked nor lived there;\n(i)     since Jamala could not have expected the accused to throw the package out of the train window, and bearing in mind the speed at which the train was travelling, the darkness of the hour and the nature of the lighting on the overhead bridge, Jamala was able to observe with great clarity not only the accused’s actions, but Yusoff standing in the vicinity of the overhead bridge and responding to the accused’s gestures;\n(j)     although Jamala had been afraid of returning to Singapore with the accused when she realised that he had purchased drugs in Penang, and sought to distance herself from him on the train, she readily returned to the flat with him, making no effort to go back to her parents’ home close by; and no suitcase was found in the flat; and no evidence was led as to who, if anyone, paid rent for the flat after its registered occupant died in 1984;\n(k)     although, on the prosecution case, Yusoff was prima facie an abettor of the offence with which the accused was charged, SNO Jamaludin chose not to charge him and sent him to DRC on the day following his arrest;\n(l)     a DPP decided to withdraw the charge against Jamala. He gave no reason to SNO Jamaludin for his decision to do so, and following her acquittal she gave evidence for the Prosecution at the preliminary inquiry and at the trial;\n(m)     Jamala’s allegations that the accused’s father attempted to bribe her; that she was assaulted by the young Chinese men; and that she was threatened by the accused’s younger brother were never investigated; and\n(n)     SNO Jamaludin did not carry out any investigations in Malaysia with a view to ascertaining whether the accused had been in that country between 1 October and 9 October 1986.",
      "57": "In assessing the accused’s credibility, we put out of our minds that he is an acknowledged drug abuser, and has been for a decade or more. There were a number of crucial parts of his evidence which we disbelieved, and rejected. We did not believe that, after absconding from the day release scheme in June/July 1985, the accused did not visit the flat until March 1986, and that he did so on that occasion because he was invited in by Yusoff. Yusoff, according to the accused, was a man he first met at the DRC in 1981. He had seen him on two further occasions in or about 1983. It was incredible that this casual acquaintance should have suddenly turned up at the flat, opposite the apartment of the accused’s parents, wearing a sarong and to all the world the occupant of the flat. We also rejected the accused’s evidence that, from the time he absconded he slept rough, wherever he could, washing himself at public toilets, and hardly ever changing his clothes, when the flat opposite his parents’ had fallen vacant in 1984, its registered occupant having died. Immediately after the accused’s arrest, SNO Jamaludin had handed the keys of the flat to the accused’s stepfather, with certain other items found in the flat, and the latter had accepted them.",
      "58": "We found as a fact that the accused had access to and made use of the flat, and we accepted the evidence of ANO Riduan that the accused acknowledged to him that he was the owner of the cupboard, and the keys to the drawers. In his effort to dissociate himself from ownership of this piece of furniture and its contents, the accused denied that the money recovered by SNO Jamaludin was found in the drawer, and asserted that the money was taken from the wallet he threw to his mother in the corridor as he was led away. However, neither the accused’s mother, nor any other witness, was called to support the accused’s evidence of the alleged incident in the corridor. We also took into account the evidence of Jamala, which we believed, that some time after she and the accused returned to the flat on 9 October, the accused left the flat for a period, leaving the keys to the flat and to the cupboard with her.",
      "59": "We disbelieved the accused’s account of the alleged assaults in the flat, and having regard to the medical evidence, we did not accept that the accused’s faculties were impaired by the consumption of drugs, to the extent that his oral and written statements could be said to have been of little or no probative value. Dr Isaac acknowledged that he was not an expert in the field of drug abuse, but he was confident that had the accused exhibited any of the symptoms of withdrawal, he would have observed and made a note of them. Although slightly wet nasal passages could be a symptom of the onset of withdrawal, the accused had complained of flu at the post-statement examination, and the doctor had apparently prescribed Panadol. Dr Isaac’s opinion was that the accused was not exhibiting withdrawal symptoms. The accused was alert and lucid, and we accepted the doctor’s evidence that a statement made by the accused at about the time the examinations were carried out would have been reliable to the extent that it would not have been affected by earlier consumption by the accused of drugs.",
      "60": "Counsel for the accused criticised the failure of the Prosecution to call Yusoff. He submitted that this left a serious gap in the prosecution case. It was not enough that Yusoff was offered as a witness to the Defence, and an adverse inference should be drawn from the fact that Yusoff was not called as a witness for the Prosecution, the Defence being under no obligation to call him as their witness. Counsel relied on Abdullah Zawawi v PP [1985] 2 MLJ 16. In our view, that case is distinguishable, the Prosecution there having failed to call the only witness capable of explaining certain crucial facts. Salleh Abas LP, delivering the judgment of the Federal Court, said at 18:",
      "61": "The case before us is different. The essential elements of the offence were capable of being, and were, established without the need to call Yusoff. Jamala’s evidence was that she packed the 33 sachets, which were not all the same size, and which the accused had purchased in Penang. She carried them onto the train in a plastic bag at his request, and after the train had entered Singapore, the accused threw the package out of the train to the waiting Yusoff. Jamala heard Yusoff confirm in the flat that he had retrieved the package, and later that afternoon 33 sachets, 20 large and 13 smaller, contained in a plastic bag, were recovered from the flat, to which the accused had access, in a drawer to which he held the key. The contents of the sachets contained not less than 50.61g of diamorphine. That evidence was not inherently incredible and, if accepted as accurate, established the essential elements of the offence at the end of the prosecution case. Yusoff’s evidence was not crucial, and the decision not to call him, and to offer him to the Defence, did not amount to a failure on the part of the Prosecution to discharge the onus of proof which lay upon it.",
      "62": "We disbelieved the accused’s alibi. It was unsupported by any independent evidence, and the accused was wholly unconvincing in his account of it. Furthermore, the alibi had to be balanced against Jamala’s evidence. Her cross-examination, and the questioning of her by us, occupied the better part of three days. Jamala was 21 years old at the time of her arrest. She is about 23 now. In our assessment, she is intelligent and shrewd. We regarded her as an accomplice and we considered her evidence with much circumspection. We took into account that a great deal of crucial evidence she gave at the trial did not form part of her evidence at the preliminary inquiry.",
      "63": "We also drew the inference that the charge against Jamala had been dropped so that she would be free to give evidence against the accused, in all likelihood because the CNB had failed to recover the passport used by the accused which, together with his oral and written statements, would have been enough to form the basis of a prosecution.",
      "64": "In the course of giving evidence, Jamala sought to sanitise her character and distance herself from the offence. She fudged her evidence about the hotels at which she stayed in Malaysia between 1 October and 9 October and became amnesiac about the reasons for her numerous visits to that country in the 15 months or so prior to October 1986. We nevertheless found that when Jamala went to Malaysia on 1 October 1986, she was accompanied by the accused, who travelled on a false passport. Putting it at its lowest, we found that Jamala was aware of the purchase by the accused of the drugs in Penang, and witnessed the transaction at much closer quarters than she was prepared to admit. We concluded that she carried the package containing the drugs onto the train at Johore Bahru by arrangement with the accused, in furtherance of the common intention of them both to import the drugs into Singapore. We believed that she witnessed the package being thrown out of the train by the accused, to the waiting Yusoff, that Yusoff retrieved it and took it to the flat, and that its contents were seized by the CNB officers when they carried out the raid.",
      "65": "We have indicated areas in the prosecution case which gave us pause, lest it be said that we failed to take account of them, but having regard to the evidence as whole, in particular Jamala’s evidence in so far as it bore on the importation of the drugs, the accused’s voluntary oral and written statements, and our assessment of the accused’s credibility, we were satisfied of the accused’s guilt beyond reasonable doubt. We convict him as charged."
    }
  }
]
